INSERT INTO city_tb (name)
VALUES ('서울특별시'),
       ('부산광역시');

INSERT INTO country_tb (city_id, name)
VALUES (1, '강남구'),
       (1, '강서구'),
       (1, '종로구'),
       (1, '노원구'),
       (1, '중랑구'),
       (2, '해운대구'),
       (2, '금정구');

INSERT INTO district_tb (statutory_code, country_id, name)
VALUES (0, 1, '신사동'),
       (0, 1, '압구정동'),
       (0, 1, '논현동'),
       (0, 1, '청담동'),
       (0, 1, '삼성동'),
       (0, 1, '대치동'),
       (0, 1, '역삼동'),
       (0, 1, '도곡동'),
       (0, 1, '일원동'),
       (0, 1, '개포동'),
       (0, 1, '수서동'),
       (0, 1, '일원동'),
       (0, 1, '세곡동'),
       (0, 1, '율현동'),
       (0, 1, '자곡동'),
       (0, 2, '염창동'),
       (0, 2, '동촌동'),
       (0, 3, '청운효자동'),
       (0, 3, '사직동'),
       (0, 3, '삼청동'),
       (0, 4, '월계동'),
       (0, 4, '공릉동'),
       (0, 4, '하계동'),
       (0, 5, '망우동'),
       (0, 5, '면목동'),
       (0, 6, '반송동'),
       (0, 6, '반여동'),
       (0, 6, '송정동'),
       (0, 6, '우동'),
       (0, 6, '좌동'),
       (0, 6, '중동'),
       (0, 6, '재송동'),
       (0, 7, '구서동'),
       (0, 7, '금사회동동'),
       (0, 7, '금성동'),
       (0, 7, '남산동'),
       (0, 7, '부곡동'),
       (0, 7, '서동'),
       (0, 7, '장전동'),
       (0, 7, '청룡노포동');

-- 비밀번호는 test12!@
INSERT INTO user_tb (name, email, password, district_id, role)
VALUES ('김볼링', 'test@test.com', '{bcrypt}$2a$10$yK46P9/7TyA2J4z69uEEhOdInb6a7lgHNWVfqftsQSwvLgwSZv9Mq', 1, 'ROLE_USER');
